update uml on README.md
